Revit 2026 API

# SpeckleSpeckleColor2 Property

---

The property labeled "Color 2" from the "Speckle" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string SpeckleColor2 { get; }
```
```vb
Public Shared ReadOnly Property SpeckleColor2 As String
	Get
```
```cpp
public:
static property String^ SpeckleColor2 {
	String^ get ();
}
```
```fsharp
static member SpeckleColor2 : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

Speckle Class

Autodesk.Revit.DB.Visual Namespace